import React from 'react';

const Blogs = () => {
    return (
        <div className='container mt-5 '>
          <div className='row'>
            <div className='col col-lg-6'>
                <h4 className='text-center'>Context Api</h4>
                <h3>কনটেক্সট প্রতিটি স্তরে ম্যানুয়ালি প্রপস ডাউন না করেই কম্পোনেন্ট ট্রির মাধ্যমে ডেটা পাস করার একটি উপায় প্রদান করে। এটি একটি টাওয়ার মতো কাজ করে। যেমন: মোবাইল টাওয়ারের কারনে আমারা যে কোন জাগয়া থেকে কিন্তু ইন্টারনেট চালাতে পারি বা ডাটা আদান-প্রদানর করতে পারি। ঠিক কনটেক্সেট  এ.পি. আই. এর মাধ্যমে কোন রকম মাধ্যম ছাড়া আমরা ডাটা আদান-প্রদান করতে পারি </h3>
            </div>

            <div className='col col-lg-6'>
                <h4>What is symmetric tag?</h4>
                <h3>একটি শব্দার্থিক উপাদান ব্রাউজার এবং বিকাশকারী উভয়ের কাছে এর অর্থ স্পষ্টভাবে বর্ণনা করে। কিন্তু এর কোন নিজস্ব অর্থ নেই। এটা নিজের বিষয়বস্তু সম্পকে কিছু বলে না। </h3>
                <br />
              
                <h4>What is inline-block? & What is an inline-block element?</h4>

                <h3> ইনলাইন-ব্লক হল তালিকা আইটেমগুলি উল্লম্বভাবে না করে অনুভূমিকভাবে প্রদর্শন করা। সহজভাষায় বলতে গেলে: এগুলো নিচে নিচে না বলে পাশাপশি বসে।</h3>

                <br />
                <h3>
                ইনলাইন-ব্লক উপাদানগুলি ইনলাইন উপাদানগুলির অনুরূপ, ব্যতীত তাদের চারটি দিকে প্যাডিং এবং মার্জিন যোগ করা যেতে পারে। আপনার CSS কোডে প্রদর্শন: ইনলাইন-ব্লক ঘোষণা করতে হবে।
                </h3>

            </div>
          </div>
        </div>
    );
};

export default Blogs;